app/controllers/ideas/likes_controller.rb

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
      @idea = Idea.find(params[:idea_id])

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "idea_likes" ("idea_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["idea_id", 1], ["user_id", 2], ["created_at", "2018-03-29 18:46:45.605904"], ["updated_at", "2018-03-29 18:46:45.605904"]]
SELECT  "idea_likes".* FROM "idea_likes" WHERE "idea_likes"."idea_id" = ? AND "idea_likes"."id" = ? LIMIT ?  [["idea_id", 5], ["id", 5], ["LIMIT", 1]]
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def create
      @idea = Idea.find(params[:idea_id])
      @idea_like = @idea.idea_likes.build(user: current_user)

      respond_to do |format|
        if @idea_like.save
          format.html {redirect_to @idea, notice: 'Idea was successfully liked.'}
          format.json {render :show, status: :created, location: @idea_like}
        else
          format.html {redirect_to @idea, alert: @idea_like.errors.full_messages.join('\n')}

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "idea_likes" WHERE "idea_likes"."id" = ?  [["id", 88]]
SELECT "idea_likes".* FROM "idea_likes" WHERE "idea_likes"."idea_id" = ? AND "idea_likes"."user_id" = ?  [["idea_id", 11], ["user_id", 1]]
---
    def destroy
      @idea = Idea.find(params[:idea_id])
      @idea.idea_likes.where(user: current_user).destroy_all