app/views/ideas/index.html.erb

SELECT "ideas".* FROM "ideas"
---
    <tr>
      <td><%= idea.idea_likes.count %></td>