app/views/ideas/show.html.erb


<% if @idea.idea_likes.where(user: current_user).exists? %>
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."user_id" = ? AND "ideas"."id" = ? LIMIT ?  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
SELECT  1 AS one FROM "idea_likes" WHERE "idea_likes"."idea_id" = ? AND "idea_likes"."user_id" = ? LIMIT ?  [["idea_id", 1], ["user_id", 1], ["LIMIT", 1]]


<% if @idea.idea_likes.where(user: current_user).none? %>
---
SELECT  1 AS one FROM "idea_likes" WHERE "idea_likes"."idea_id" = ? AND "idea_likes"."user_id" = ? LIMIT ?  [["idea_id", 1], ["user_id", 1], ["LIMIT", 1]]

<% end %>
<%= @idea.idea_likes.count %>
---
SELECT COUNT(*) FROM "idea_likes" WHERE "idea_likes"."idea_id" = ?  [["idea_id", 12]]