app/controllers/comments_controller.rb

  def index
    @idea = Idea.find(params[:idea_id])
    @comments = @idea.comments.all
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."idea_id" = ?  [["idea_id", 1]]

  def show
    @idea = Idea.find(params[:idea_id])
    @comments = @idea.comments.find(params[:id])
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."idea_id" = ? AND "comments"."id" = ? LIMIT ?  [["idea_id", 1], ["id", 3], ["LIMIT", 1]]

  def new
    @idea = Idea.find(params[:idea_id])
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @idea = Idea.find(params[:idea_id])
    @comment = @idea.comments.find(params[:id])
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."idea_id" = ? AND "comments"."id" = ? LIMIT ?  [["idea_id", 1], ["id", 1], ["LIMIT", 1]]

  def create
    @idea = Idea.find(params[:idea_id])
    @comment = @idea.comments.build(comment_params)

    respond_to do |format|
      if @comment.save
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "idea_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "bla bla"], ["idea_id", 1], ["created_at", "2018-03-24 20:54:05.872399"], ["updated_at", "2018-03-24 20:54:05.872399"]]

  def destroy
    @idea = Idea.find(params[:idea_id])
    @comment.destroy
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 11]]