app/controllers/ideas_controller.rb

  def show
    @idea = Idea.find(params[:id])
    @comments = @idea.comments.all
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."idea_id" = ? AND "comments"."id" = ? LIMIT ?  [["idea_id", 1], ["id", 1], ["LIMIT", 1]]

  def create
    @idea = current_user.ideas.build(idea_params)

    respond_to do |format|
      if @idea.save
---
INSERT INTO "ideas" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "new new new"], ["description", "blabluble"], ["created_at", "2018-03-29 22:05:06.641769"], ["updated_at", "2018-03-29 22:05:06.641769"], ["user_id", 2]]

  def update
    respond_to do |format|
      if @idea.update(idea_params)
---
UPDATE "ideas" SET "description" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["description", "ble ble blu"], ["updated_at", "2018-03-29 22:58:50.744824"], ["id", 8]]

  def set_idea
    @idea = current_user.ideas.find(params[:id])
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."user_id" = ? AND "ideas"."id" = ? LIMIT ?  [["user_id", 2], ["id", 9], ["LIMIT", 1]]